* twostkbd key code assignment
** key-gpio table
|-----+----+-------|
| SW0 | 23 | k0    |
| SW1 | 25 | k1    |
| SW2 |  7 | k2    |
| SW3 | 21 | k3    |
| SW4 | 16 | k4    |
| SW5 | 26 | k5    |
| SF0 |  4 | f0    |
| SF1 |  8 | f1    |
| SF2 | 12 | f2    |
| SF3 | 20 | f3    |
| SM0 | 14 | alt   |
| SM1 | 18 | ctrl  |
| SM2 | 15 | shift |
| SM3 | 24 | ext   |
|-----+----+-------|

** 6-key table
|-----+-----+-----+-----+-------+-----+------+-----|
| No. | key | 1st | 2nd | shift | alt | ctrl | ext |
|-----+-----+-----+-----+-------+-----+------+-----|
|   0 | a   |   0 |   0 |       |     |      | F12 |
|   1 | o   |   1 |   1 |       |     |      | ESC |
|   2 | e   |   2 |   2 |       |     |      | ,   |
|   3 | i   |   3 |   3 |       |     |      | .   |
|   4 | u   |   1 |   2 |       |     |      | (   |
|   5 | t   |   2 |   1 |       |     |      | )   |
|   6 | n   |   2 |   3 |       |     |      | "   |
|   7 | s   |   3 |   2 |       |     |      | '   |
|   8 | r   |   1 |   3 |       |     |      | -   |
|   9 | d   |   3 |   1 |       |     |      | _   |
|  10 | x   |   0 |   2 |       |     |      | F2  |
|  11 | c   |   2 |   0 |       |     |      | F7  |
|  12 | l   |   0 |   3 |       |     |      | F3  |
|  13 | f   |   3 |   0 |       |     |      | F8  |
|  14 | p   |   0 |   1 |       |     |      | F1  |
|  15 | b   |   1 |   0 |       |     |      | F6  |
|  16 | h   |   4 |   4 |       |     |      | *   |
|  17 | y   |   5 |   5 |       |     |      | ;   |
|  18 | m   |   1 |   5 |       |     |      | {   |
|  19 | g   |   5 |   1 |       |     |      | }   |
|  20 | v   |   2 |   5 |       |     |      | <   |
|  21 | k   |   5 |   2 |       |     |      | >   |
|  22 | w   |   0 |   5 |       |     |      | F5  |
|  23 | j   |   5 |   0 |       |     |      | F10 |
|  24 | q   |   3 |   5 |       |     |      | [   |
|  25 | z   |   5 |   3 |       |     |      | ]   |
|  26 | 0   |   0 |   4 |       |     |      | F4  |
|  27 | 1   |   1 |   4 | !     |     |      | +   |
|  28 | 2   |   2 |   4 | @     |     |      | /   |
|  29 | 3   |   3 |   4 | #     |     |      | \   |
|  30 | 4   |   5 |   4 | $     |     |      | :   |
|  31 | 5   |   4 |   0 | %     |     |      | F9  |
|  32 | 6   |   4 |   1 | ^     |     |      | =   |
|  33 | 7   |   4 |   2 | &     |     |      | ?   |
|  34 | 8   |   4 |   3 | VBAR  |     |      | `   |
|  35 | 9   |   4 |   5 | ~     |     |      | F11 |
|-----+-----+-----+-----+-------+-----+------+-----|
#+TBLFM: @<<<..@>$1=@-1$1+1

** fkey table
|-------+------+-------+-----+------+-----|
| f.key | func | shift | alt | ctrl | ext |
|-------+------+-------+-----+------+-----|
|     0 | TAB  |       |     |      |     |
|     1 | BS   |       |     |      |     |
|     2 | RET  |       |     |      |     |
|     3 | SP   |       |     |      |     |
|-------+------+-------+-----+------+-----|

** fmode table
|-----+------+-------+-------+-------+-----+-------+-----+----+--------+-------+-------+-------+-----|
| alt | ctrl | shift | ext   | k0    | k1  | k2    | k3  | k4 | k5     | f0    | f1    | f2    | f3  |
|-----+------+-------+-------+-------+-----+-------+-----+----+--------+-------+-------+-------+-----|
|   0 | COPY | HOME  | CLEFT | LEFT  | UP  | RIGHT | END | SP | CRIGHT | PASTE | DOWN  | RET   | BS  |
|   1 | CTAB | TAB   |       | CHOME | PUP | CEND  |     |    | ESC    |       | PDOWN | CSDEL | DEL |
|-----+------+-------+-------+-------+-----+-------+-----+----+--------+-------+-------+-------+-----|
